ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/ЗаявленияНаПриемВСпортивноеУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПриемВСпортивноеУчреждение</name>
  <registerRecords>InformationRegister.ПредоставленныеДокументыСпортсменов</registerRecords>
  <registerRecords>InformationRegister.СоставУчащихсяСпортивногоУчреждения</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностиРазвитияИЗдоровьяСпортсмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаОбработкуПерсональныхДанныхПолучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСогласиеНаОбработкуПерсональныхДанных</name>
    <type>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерновикЗаявления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.СтатусыЗаявленийНаПриемВСпортивноеУчреждение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоИзВнешнегоИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредоставленныеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыДокументовДляПриемаВСпортивноеУчреждение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоставленаКопия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлДокумента</name>
      <type>
        <types>CatalogRef.ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/Forms/ФормаЭлементаПредоставления/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрытиеРазрешено;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		
		Объект.Организация = Параметры.Организация;
		
	КонецЕсли;
	
	ЗначениеЗаявления = ДанныеФормыВЗначение(Параметры.Объект, Тип("ДокументОбъект.ЗаявленияНаПриемВСпортивноеУчреждение"));
	ЗначениеВРеквизитФормы(ЗначениеЗаявления, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		
		ТекстПредупреждения = "Завершить работу с программой?";
		Отказ = Истина;
		
    ИначеЕсли ЗакрытиеРазрешено = Неопределено Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Работа в данном окне завершена?", РежимДиалогаВопрос.ДаНет);
        Отказ = Истина;
		
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредоставленныеДокументы

&НаКлиенте
Процедура ОбъектПредоставленныеДокументыФайлДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПредоставленныеДокументыОткрыть(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыОткрыть(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	ОповещениеОЗакрыти = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, , , , , ОповещениеОЗакрыти);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт 

	ТекущиеДанные = Элементы.ОбъектПредоставленныеДокументы.ТекущиеДанные;
	ТекущиеДанные.ФайлДокумента = Результат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)

	Закрыть(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗакрытиеРазрешено = Истина;
		Закрыть(Объект);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеПредоставленныеДокументыФайлДокументаПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	ПредоставленныеДокументыОткрыть(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеПредоставленныеДокументыФайлДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредоставленныеДокументыОткрыть(Элемент);
КонецПроцедуры

#КонецОбласти
